app/views/projects/show.html.haml

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 9]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? ORDER BY updated_at DESC  [["project_id", 9]]
---
    .col-10.d-flex
      - if @project.tasks.present?
        .card-columns
          - @project.tasks.order("updated_at desc").each do |task|
            .card.text-center.ht-190.task{"data-url" => edit_task_path(task)}
              .card-body.py-3.border-bottom-primary