app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]
---
  def index
    @projects = current_user.projects
    respond_to do |format|
      if @projects.present?
        format.html { redirect_to @projects.first }

INSERT INTO "projects" ("name", "created_at", "updated_at", "user_id", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Alpha Team"], ["created_at", "2020-09-12 08:55:30.372273"], ["updated_at", "2020-09-12 08:55:30.372273"], ["user_id", 1], ["description", "Dev"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "description" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["description", "adding."], ["updated_at", "2020-09-14 05:42:09.096299"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)