app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "status", "deadline", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "tasks" ("title", "description", "status", "deadline", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
        @task.document.attach(task_params[:document])

UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", 3], ["updated_at", "2020-09-14 16:46:23.440962"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)