app/views/layouts/_navigation.haml

        .dropdown-menu{"aria-labelledby" => "navbarDropdown"}
          - current_user.projects.each do |project|
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]